In [28]:
import pandas as pd
print(pd.__version__)

2.3.3

In [59]:
my_dataset = {
    'Name': ['Alice', ' ', 'Charlie', 'David'],
    'Age': [24, 27, 22, 32],
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston']
}

df = pd.DataFrame(my_dataset)
print(df)

      Name  Age         City
0    Alice   24     New York
1            27  Los Angeles
2  Charlie   22      Chicago
3    David   32      Houston

In [60]:
pd.Series(my_dataset['Name'])

0      Alice
1
2    Charlie
3      David
dtype: object

In [61]:
print(df)
print(df['Name'][0])
print(df['Age'][:])

      Name  Age         City
0    Alice   24     New York
1            27  Los Angeles
2  Charlie   22      Chicago
3    David   32      Houston
Alice
0    24
1    27
2    22
3    32
Name: Age, dtype: int64

In [62]:
df.index = ['a', 'b', 'c', 'd']
print(df)

      Name  Age         City
a    Alice   24     New York
b            27  Los Angeles
c  Charlie   22      Chicago
d    David   32      Houston

In [63]:
df = df.set_index('Name') ## column "name' as index
print(df)

         Age         City
Name
Alice     24     New York
          27  Los Angeles
Charlie   22      Chicago
David     32      Houston

In [64]:
df

         Age         City
Name
Alice     24     New York
          27  Los Angeles
Charlie   22      Chicago
David     32      Houston

In [65]:
print(df.loc[["Alice", "David"]])

       Age      City
Name
Alice   24  New York
David   32   Houston

In [66]:
print(type(df))

<class 'pandas.core.frame.DataFrame'>

In [67]:
df = df.reset_index()
print(df)

      Name  Age         City
0    Alice   24     New York
1            27  Los Angeles
2  Charlie   22      Chicago
3    David   32      Houston

In [68]:
print(df.loc[0: 2])

      Name  Age         City
0    Alice   24     New York
1            27  Los Angeles
2  Charlie   22      Chicago

In [69]:
print(df.loc[[0, 1, 2]])

      Name  Age         City
0    Alice   24     New York
1            27  Los Angeles
2  Charlie   22      Chicago

In [70]:
print(type(df))

<class 'pandas.core.frame.DataFrame'>

In [71]:
df1 = pd.read_csv("all_medicine databased.csv")
df1.head()

C:\Users\mural\AppData\Local\Temp\ipykernel_14668\1397996569.py:1: DtypeWarning: Columns (42,43,44,45,46,47,48) have mixed types. Specify dtype option on import or set low_memory=False.
  df1 = pd.read_csv("all_medicine databased.csv")

,id,name,substitute0,substitute1,substitute2,substitute3,substitute4,sideEffect0,sideEffect1,sideEffect2,...,sideEffect41,use0,use1,use2,use3,use4,Chemical Class,Habit Forming,Therapeutic Class,Action Class
0,1,augmentin 625 duo tablet,Penciclav 500 mg/125 mg Tablet,Moxikind-CV 625 Tablet,Moxiforce-CV 625 Tablet,Fightox 625 Tablet,Novamox CV 625mg Tablet,Vomiting,Nausea,Diarrhea,...,NaN,Treatment of Bacterial infections,NaN,NaN,NaN,NaN,NaN,No,ANTI INFECTIVES,NaN
1,2,azithral 500 tablet,Zithrocare 500mg Tablet,Azax 500 Tablet,Zady 500 Tablet,Cazithro 500mg Tablet,Trulimax 500mg Tablet,Vomiting,Nausea,Abdominal pain,...,NaN,Treatment of Bacterial infections,NaN,NaN,NaN,NaN,Macrolides,No,ANTI INFECTIVES,Macrolides
2,3,ascoril ls syrup,Solvin LS Syrup,Ambrodil-LX Syrup,Zerotuss XP Syrup,Capex LS Syrup,Broxum LS Syrup,Nausea,Vomiting,Diarrhea,...,NaN,Treatment of Cough with mucus,NaN,NaN,NaN,NaN,NaN,No,RESPIRATORY,NaN
3,4,allegra 120mg tablet,Lcfex Tablet,Etofex 120mg Tablet,Nexofex 120mg Tablet,Fexise 120mg Tablet,Histafree 120 Tablet,Headache,Drowsiness,Dizziness,...,NaN,Treatment of Sneezing and runny nose due to al...,Treatment of Allergic conditions,NaN,NaN,NaN,Diphenylmethane Derivative,No,RESPIRATORY,H1 Antihistaminics (second Generation)
4,5,avil 25 tablet,Eralet 25mg Tablet,NaN,NaN,NaN,NaN,Sleepiness,Dryness in mouth,NaN,...,NaN,Treatment of Allergic conditions,NaN,NaN,NaN,NaN,Pyridines Derivatives,No,RESPIRATORY,H1 Antihistaminics (First Generation)

In [72]:
df.to_string()

'      Name  Age         City\n0    Alice   24     New York\n1            27  Los Angeles\n2  Charlie   22      Chicago\n3    David   32      Houston'

In [73]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 248218 entries, 0 to 248217
Data columns (total 58 columns):
 #   Column             Non-Null Count   Dtype
---  ------             --------------   -----
 0   id                 248218 non-null  int64
 1   name               248218 non-null  object
 2   substitute0        238621 non-null  object
 3   substitute1        233867 non-null  object
 4   substitute2        230233 non-null  object
 5   substitute3        226856 non-null  object
 6   substitute4        223962 non-null  object
 7   sideEffect0        248218 non-null  object
 8   sideEffect1        238416 non-null  object
 9   sideEffect2        229500 non-null  object
 10  sideEffect3        207638 non-null  object
 11  sideEffect4        163560 non-null  object
 12  sideEffect5        131258 non-null  object
 13  sideEffect6        91857 non-null   object
 14  sideEffect7        67750 non-null   object
 15  sideEffect8        48506 non-null   object
 16  sideEffect9        37708 non-null   object
 17  sideEffect10       27274 non-null   object
 18  sideEffect11       20331 non-null   object
 19  sideEffect12       16282 non-null   object
 20  sideEffect13       14727 non-null   object
 21  sideEffect14       10419 non-null   object
 22  sideEffect15       7681 non-null    object
 23  sideEffect16       6009 non-null    object
 24  sideEffect17       5382 non-null    object
 25  sideEffect18       4515 non-null    object
 26  sideEffect19       3946 non-null    object
 27  sideEffect20       3223 non-null    object
 28  sideEffect21       3125 non-null    object
 29  sideEffect22       3048 non-null    object
 30  sideEffect23       2905 non-null    object
 31  sideEffect24       2723 non-null    object
 32  sideEffect25       1503 non-null    object
 33  sideEffect26       1503 non-null    object
 34  sideEffect27       1494 non-null    object
 35  sideEffect28       1494 non-null    object
 36  sideEffect29       1438 non-null    object
 37  sideEffect30       1329 non-null    object
 38  sideEffect31       1329 non-null    object
 39  sideEffect32       1328 non-null    object
 40  sideEffect33       1169 non-null    object
 41  sideEffect34       1166 non-null    object
 42  sideEffect35       2 non-null       object
 43  sideEffect36       2 non-null       object
 44  sideEffect37       2 non-null       object
 45  sideEffect38       2 non-null       object
 46  sideEffect39       2 non-null       object
 47  sideEffect40       2 non-null       object
 48  sideEffect41       2 non-null       object
 49  use0               248218 non-null  object
 50  use1               73365 non-null   object
 51  use2               28307 non-null   object
 52  use3               7379 non-null    object
 53  use4               4971 non-null    object
 54  Chemical Class     137791 non-null  object
 55  Habit Forming      248218 non-null  object
 56  Therapeutic Class  248149 non-null  object
 57  Action Class       138036 non-null  object
dtypes: int64(1), object(57)
memory usage: 109.8+ MB

In [74]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    4 non-null      object
 1   Age     4 non-null      int64
 2   City    4 non-null      object
dtypes: int64(1), object(2)
memory usage: 228.0+ bytes

In [75]:
new_df = df.dropna()
new_df.head()

      Name  Age         City
0    Alice   24     New York
1            27  Los Angeles
2  Charlie   22      Chicago
3    David   32      Houston

In [111]:
df.isna().sum()

Name    0
Age     0
City    0
dtype: int64

In [110]:

import numpy as np

df["Name"] = df["Name"].replace(r'^\s*$', np.nan, regex=True)

In [112]:
df.fillna(method ='ffill', inplace=True)  #--> fills NaN values with the previous value in the column, bfill method --> fills NaN values with the next value in the column
print(df)

      Name  Age         City
0    Alice   24     New York
1  Charlie   27  Los Angeles
2  Charlie   22      Chicago
3    David   32      Houston

C:\Users\mural\AppData\Local\Temp\ipykernel_14668\1305982807.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method ='ffill', inplace=True)  #--> fills NaN values with the previous value in the column, bfill method --> fills NaN values with the next value in the column

In [113]:
df

      Name  Age         City
0    Alice   24     New York
1  Charlie   27  Los Angeles
2  Charlie   22      Chicago
3    David   32      Houston

In [103]:
print(type(new_df))

<class 'pandas.core.frame.DataFrame'>

In [131]:
df.loc[1, 'Name'] = 'Bob'  #--> changing specific value in dataframe
print(df)

      Name   Age      City
0    Alice  24.0  New York
2  Charlie  22.0   Chicago
3    David  32.0   Houston
1      Bob   NaN       NaN

In [130]:
df.drop('1', inplace=True)  #--> drops the row with index 'Bob'

In [132]:
df.reset_index(inplace=True)

In [133]:
df

   index     Name   Age      City
0      0    Alice  24.0  New York
1      2  Charlie  22.0   Chicago
2      3    David  32.0   Houston
3      1      Bob   NaN       NaN

In [134]:
df.drop('index', axis=1, inplace=True)

In [135]:
df

      Name   Age      City
0    Alice  24.0  New York
1  Charlie  22.0   Chicago
2    David  32.0   Houston
3      Bob   NaN       NaN

In [136]:
df.loc[3, 'Age'] = 33
df.loc[3, 'City'] = 'San Francisco'
df

      Name   Age           City
0    Alice  24.0       New York
1  Charlie  22.0        Chicago
2    David  32.0        Houston
3      Bob  33.0  San Francisco

In [140]:
print(df1.duplicated())

0         False
1         False
2         False
3         False
4         False
          ...
248213    False
248214    False
248215    False
248216    False
248217    False
Length: 248218, dtype: bool

In [143]:
new_df.corr(numeric_only=True)

     Age
Age  1.0